; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	infrared0 - mode
	infrared1 - mode
	GroundStation5 - direction
	GroundStation4 - direction
	Star1 - direction
	Star6 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star0 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument1 infrared0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation5)
	(supports instrument3 infrared0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon16)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument5 infrared1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
)
(:goal (and
	(have_image Star7 infrared1)
	(have_image Star8 infrared1)
	(have_image Star9 infrared0)
	(have_image Planet10 infrared1)
	(have_image Planet11 infrared0)
	(have_image Phenomenon12 infrared1)
	(have_image Planet13 infrared1)
	(have_image Planet14 infrared1)
	(have_image Planet15 infrared1)
	(have_image Phenomenon16 infrared1)
	(have_image Star17 infrared0)
))

)

; plan
1. (turn_to satellite1 groundstation3 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 11
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 11
3. (calibrate satellite1 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 0 of 11
4. (turn_to satellite1 planet13 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet13)
   goals met: 0 of 11
5. (take_image satellite1 planet13 instrument1 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 1 of 11
6. (turn_to satellite1 planet11 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet11)
   goals met: 1 of 11
7. (take_image satellite1 planet11 instrument1 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 2 of 11
8. (turn_to satellite1 planet10 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet10)
   goals met: 2 of 11
9. (take_image satellite1 planet10 instrument1 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 3 of 11
10. (turn_to satellite1 phenomenon16 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon16)
   goals met: 3 of 11
11. (take_image satellite1 phenomenon16 instrument1 infrared1)
   added: (have_image phenomenon16 infrared1)
   goals met: 4 of 11
12. (turn_to satellite1 phenomenon12 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 phenomenon12)
   goals met: 4 of 11
13. (take_image satellite1 phenomenon12 instrument1 infrared1)
   added: (have_image phenomenon12 infrared1)
   goals met: 5 of 11
14. (turn_to satellite1 planet14 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet14)
   goals met: 5 of 11
15. (take_image satellite1 planet14 instrument1 infrared1)
   added: (have_image planet14 infrared1)
   goals met: 6 of 11
16. (turn_to satellite1 planet15 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet15)
   goals met: 6 of 11
17. (take_image satellite1 planet15 instrument1 infrared1)
   added: (have_image planet15 infrared1)
   goals met: 7 of 11
18. (turn_to satellite1 star17 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star17)
   goals met: 7 of 11
19. (take_image satellite1 star17 instrument1 infrared0)
   added: (have_image star17 infrared0)
   goals met: 8 of 11
20. (turn_to satellite1 star7 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 star7)
   goals met: 8 of 11
21. (take_image satellite1 star7 instrument1 infrared1)
   added: (have_image star7 infrared1)
   goals met: 9 of 11
22. (turn_to satellite1 star8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star8)
   goals met: 9 of 11
23. (take_image satellite1 star8 instrument1 infrared1)
   added: (have_image star8 infrared1)
   goals met: 10 of 11
24. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   goals met: 10 of 11
25. (take_image satellite1 star9 instrument1 infrared0)
   added: (have_image star9 infrared0)
   goals met: 11 of 11
